# используем базовый образ Python версии 3
FROM python:3

# устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# копируем файл с зависимостями проекта в рабочую директорию внутри контейнера
COPY ./requirements.txt .

# устанавливаем зависимости внутри контейнера
RUN pip install -r requirements.txt

# копируем код приложения из текущей папки в рабочую директорию внутри контейнера
COPY . .

#команда для запуска django-приложения из контейнера
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000", "--reload"]